---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NoAvailableMatchingConnector
source: html/79cac0a7-c47c-724d-33f3-e7bc0b3af392.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NoAvailableMatchingConnector Property

Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoAvailableMatchingConnector { get; }
```